---
title: SystemsAnalysisOptions
classe: Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# SystemsAnalysisOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `systemsAnalysisOptions.IsValidObject` | Boolean |
| `String OutputFolder { get; set; }` | `systemsAnalysisOptions.OutputFolder` | String |
| `String WeatherFile { get; set; }` | `systemsAnalysisOptions.WeatherFile` | String |
| `String WorkflowFile { get; set; }` | `systemsAnalysisOptions.WorkflowFile` | String |
| `Void Dispose()` | `systemsAnalysisOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```